app/controllers/pics_controller.rb

    def index
        @pics = Pic.all.order('created_at DESC')
---
SELECT "pics".* FROM "pics" ORDER BY created_at, DESC

    def create
        @pic = current_user.pics.build(pic_params)
        if @pic.save
---
INSERT INTO "pics" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "another pic"], ["description", "desc"], ["created_at", "2017-07-23 02:29:30.368742"], ["updated_at", "2017-07-23 02:29:30.368742"], ["user_id", 1]]

    def update
        if @pic.update(pic_params)
---
UPDATE "pics" SET "description" = ?, "updated_at" = ? WHERE "pics"."id" = ?  [["description", "testdesc"], ["updated_at", "2017-07-23 02:00:31.153667"], ["id", 1]]

    def destroy
        @pic.destroy
---
DELETE FROM "pics" WHERE "pics"."id" = ?  [["id", 1]]

    def find_pic
        @pic = Pic.find(params[:id])
---
SELECT  "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]